1C-peopleAPI/Информационная_база/src/DataProcessors/Тест/Тест.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>Тест</name>
  <attributes>
    <name>client_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>client_secret</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:DataProcessor>

1C-peopleAPI/Информационная_база/src/Catalogs/НастройкиИнтеграцииGoogle/НастройкиИнтеграцииGoogle.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиИнтеграцииGoogle</name>
  <attributes>
    <name>КлиентID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекретКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AccessToken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>RefreshToken</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ExpiresIn</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТокенОбновления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
</mdclass:Catalog>

1C-peopleAPI/Информационная_база/src/DataProcessors/Тест/Forms/Форма/Module.bsl
&НаСервере 
Функция ИнициализироватьНаСервере ()
	Возврат PeopleAPIСервер.ПолучитьURLАвторизации()   
КонецФункции
   
   
&НаКлиенте
Процедура Инициализировать(Команда)             
	
	// Получение URL авторизации
	Адрес = ИнициализироватьНаСервере();
	
КонецПроцедуры        

&НаКлиенте
Процедура ПолеHTMLДокументСформирован(Элемент)
	
	Адрес = Элемент.Документ.URL;
	Если СтрНайти(ВРег(Адрес), ВРег("code="), НаправлениеПоиска.СНачала) > 0 Тогда
		КодАвторизации = ИзвлечьКодАвторизации(Адрес);
		Если НЕ ПустаяСтрока(КодАвторизации) Тогда
			Закрыть(КодАвторизации);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ИзвлечьКодАвторизации(URL)
	НачалоКода = СтрНайти(ВРЕГ(URL), ВРЕГ("code="), НаправлениеПоиска.СНачала);
	Если НачалоКода = 0 Тогда
		Возврат "";
	КонецЕсли;
	НачалоКода = НачалоКода + 5;
	КонецКода = СтрНайти(URL, "&", НаправлениеПоиска.СНачала, НачалоКода);
	Если КонецКода = 0 Тогда
		Возврат Сред(URL, НачалоКода);
	КонецЕсли;

	Возврат Сред(URL, НачалоКода, КонецКода - НачалоКода);
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)     
	Настройки = Справочники.НастройкиИнтеграцииGoogle.НайтиПоНаименованию("Основные");
	Если Не Настройки.Пустая() Тогда
		Объект.client_id = Настройки.КлиентID;
		Объект.client_secret = Настройки.СекретКлиента;
	КонецЕсли;
КонецПроцедуры
